import "./style.css"
import vip from "./vipClass.jpeg";
import basic from "./basicClass.jpeg";
import free from "./freeClass.jpeg";
import React from "react";

const Classes = () => {
    return (
        <div className="classes">
            <h2 className="title-1">Price</h2>
            <ul className="cards">
                <li className="cardClass basic">
                    <img className="cardClass_img" src={basic} alt="basic class"></img>
                    <h3 className="title-2">Basic class</h3>
                    <p>
                        Тренування проходять у малокомплектних силових класах з групами від 2 до 5 осіб, що дозволяє приділяти належну увагу кожному учаснику, незалежно від кількості підопічних.
                        Мій значний досвід у сфері атлетизму та фітнесу дозволяє забезпечувати ефективний контроль і якість тренувань для всіх.
                        Вартість тренування становить 200 грн і включає абонемент до залу, мій особистий супровід та план харчування.
                        Перше заняття оплачується як разове, а подальші тренування оплачуються заздалегідь на місяць (8 або 12 тренувань).
                        Після трьох місяців навчання ціна становитиме 600 грн на місяць.
                    </p>
                </li>
                <li className="cardClass vip">
                    <img className="cardClass_img" src={vip} alt="vip class"></img>
                    <h3 className="title-2">Vip class</h3>
                    <p>
                        Тренування у форматі VIP відбуваються в закритому залі, де будемо тільки ти і я.
                        Це індивідуальні заняття, під час яких весь мій досвід, знання та увага будуть зосереджені лише на тобі, забезпечуючи максимальну ефективність і прогрес.
                        Час тренувань обговорюється персонально, щоб знайти зручний графік, що підходить саме тобі.
                        Вартість одного заняття становить 500 грн, і це інвестиція в твої індивідуальні результати та повну концентрацію на твоєму успіху.
                    </p>
                </li>
                <li className="cardClass free">
                    <img className="cardClass_img" src={free} alt="free class"></img>
                    <h3 className="title-2">Free class</h3>
                    <p>
                    Безкоштовний дитячий клас (до 18 років) — це чудова можливість для молоді розвивати фізичну форму та зміцнювати здоров'я в безпечному та підтримуючому середовищі. 
                    Тренування проходять у великій групі, але кожна дитина отримує увагу й мотивацію для досягнення своїх спортивних цілей. 
                    Ми створюємо атмосферу, де діти навчаються важливості дисципліни, наполегливості та командної роботи. 
                    Це не просто тренування — це інвестиція в здорове та активне майбутнє.
                    </p>
                </li>
                <div className="vip"></div>
            </ul>
        </div>
    )
};

export default Classes;
